
/* Presented when a URL cannot be loaded because its scheme isn't understood */
"Don't know how to load URL %@" = "Неизвестно, как загрузить URL %@";

/* Presented when an HTTP URL cannot establish a connection with a particular host */
"Could not connect to host %@" = "Не удалось подключиться к хосту %@";

/* Presented when a response from an HTTP server comes back with a bad format */
"Bad header received from server" = "Получен непригодный заголовок от сервера";

/* Presented when a description of a particular host can't be determined. */
"Can't determine IP address of host: %@" = "Невозможно определить IP-адрес сервера: %@";

/* Presented when the host description was found, but a particular port couldn't be opened. */
"Can't get a description of port %d" = "Невозможно получить описание порта %d";

/* Presented when a particular host cannot be contacted via the given port */
"Can't connect to host %@ using port %d" = "Невозможно подключиться к серверу %@ через порт %d";

/* Presented when an HTTP server comes back with an unknown status code */
"Received unknown HTTP server response %@: %@" = "Получен неизвестный ответ HTTP-сервера %@: %@";

/* Presented when an HTTP server returns a failure code */
"HTTP request failed for URL %@:%@" = "Не удалось выполнить HTTP-запрос по адресу %@:%@";

/* Presented when the connection to an HTTP server is unexpectedly lost */
"Lost connection to host %@" = "Потеряна связь с хостом %@";

/* Presented when a file can not be opened for reading (file may not exist) */
"Could not read from %@" = "Невозможно прочитать из %@";

/* Presented when a redirection loop has been detected */
"Detected a redirection loop while attempting to load URL %@" = "При попытке загрузки URL %@ обнаружена переадресовка.";

/* Presented when an FTP server hangs up or becomes otherwise unavailable */
"Service unavailable for host %@" = "Служба недоступна для хоста %@";

/* Presented when the data transfer socket cannot be created for an FTP transfer */
"Couldn't open data connection for URL path: %@" = "Не удалось открыть соединение по URL: %@";

/* Presented when the indicated URL does not locate ane existing object on the server */
"Object not available for specified URL: %@" = "Объект не доступен по указанному URL-адресу: %@";

/* Presented when the FTP server doesn't recognize a particular command */
"FTP command not recognized by host: %@" = "Хост не распознал FTP-команду: %@";

/* Presented when the FTP server rejects an authentication */
"User login or password not recognized." = "Пароль или имя пользователя не распознаны.";

/* Format used to display sizes 100 GB or greater */
"%.0f GB" = "%.0f ГБ";

/* Format used to display sizes between 100 and 999 KB */
"%.0f KB" = "%.0f КБ";

/* Format used to display sizes between 100 and 999 MB */
"%.0f MB" = "%.0f МБ";

/* Format used to display a size between 2 and 100 bytes */
"%.0f bytes" = "%.0f Б";

/* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (1.0)" = "%.1f ГБ";

/* Format used to display sizes between 10 and 99.9 GB */
"%.1f GB (10.0)" = "%.1f ГБ";

/* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (0.1)" = "%.1f КБ";

/* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (1.0)" = "%.1f КБ";

/* Format used to display sizes between 10 and 99.9 KB */
"%.1f KB (10.0)" = "%.1f КБ";

/* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (1.0)" = "%.1f МБ";

/* Format used to display sizes between 10 and 99.9 MB */
"%.1f MB (10.0)" = "%.1f МБ";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"%@ (%@)" = "%@ (%@)";

/* Format used to partial byte count along with total */
"%@ of %@" = "%@ из %@";

/* String used for showing a zero byte size */
"0 bytes" = "0 Б";

/* String used for showing a one byte size */
"1 byte" = "1 Б";

/* WebFoundationErrorCannotCreateFile description */
"Cannot create file" = "Невозможно создать файл";

/* WebFoundationErrorCannotMoveFile description */
"Cannot move file" = "Невозможно переместить файл";

/* WebFoundationErrorCannotOpenFile description */
"Cannot open file" = "Невозможно открыть файл";

/* WebFoundationErrorCannotRemoveFile description */
"Cannot remove file" = "Невозможно удалить файл";

/* WebFoundationErrorCannotWriteToFile description */
"Cannot write file" = "Невозможно записать файл";

/* WebFoundationErrorDNSLookupError description */
"DNS lookup error" = "Ошибка DNS-поиска";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Download decoding failed (at end)" = "Не удалось раскодировать загрузку";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Download decoding failed (midstream)" = "Не удалось раскодировать загрузку";

/* WebFoundationErrorCannotCloseFile description */
"Failure occurred while closing file" = "При закрытии файла произошел сбой";

/* Kind string used for keychain items from forms-based logins */
"Web form password" = "Пароль веб-формы";

/* HTTP result code string */
"accepted" = "принято";

/* WebFoundationErrorBadURLError description */
"bad URL" = "неверный URL-адрес";

/* HTTP result code string */
"bad gateway" = "неверный шлюз";

/* HTTP result code string */
"bad request" = "неверный запрос";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"bad server certificate" = "неверный сертификат сервера";

/* WebFoundationErrorBadServerResponseError description */
"bad server response" = "неверный ответ сервера";

/* WebFoundationErrorCannotDecodeRawData description */
"cannot decode raw data" = "не удается раскодировать необработанные данные";

/* WebFoundationErrorCannotDecodeContentData description */
"cannot decode content data" = "не удается раскодировать данные контента";

/* WebFoundationErrorCannotParseResponse description */
"cannot parse response" = "не удается произвести анализ ответа";

/* WebFoundationErrorCancelled description */
"cancelled" = "отменено";

/* WebFoundationErrorCannotConnectToHostError description */
"can't connect to host" = "невозможно подключиться к серверу";

/* WebFoundationErrorCannotFindHostError description */
"can't find host" = "невозможно найти сервер";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"can't load from network" = "невозможно загрузить из сети";

/* HTTP result code string */
"client error" = "ошибка клиента";

/* HTTP result code string */
"conflict" = "конфликт";

/* HTTP result code string */
"continue" = "продолжить";

/* HTTP result code string */
"created" = "создано";

/* WebFoundationErrorReadStreamError description */
"error reading stream" = "ошибка чтения потока";

/* HTTP result code string */
"expectation failed" = "не удалось получить ожидаемые данные";

/* WebFoundationErrorServerCertificateHasBadDate description */
"expired server certificate" = "срок действия сертификата сервера истек";

/* WebFoundationErrorFileDoesNotExist description */
"file doesn't exist" = "файл не cуществует";

/* WebFoundationErrorFileIsDirectory description */
"file is directory" = "файл является папкой";

/* HTTP result code string */
"forbidden" = "запрещено";

/* HTTP result code string */
"found" = "найдено";

/* HTTP result code string */
"gateway timed out" = "время ожидания шлюза закончилось";

/* HTTP result code string */
"informational" = "информационный";

/* HTTP result code string */
"internal server error" = "внутренняя ошибка сервера";

/* HTTP result code string */
"length required" = "длины требуется";

/* WebFoundationErrorNetworkConnectionLostError description */
"lost network connection" = "сетевое подключение прервано";

/* HTTP result code string */
"method not allowed" = "метод не разрешен";

/* HTTP result code string */
"moved permanently" = "перемещен окончательно";

/* HTTP result code string */
"multiple choices" = "множественный выбор";

/* HTTP result code string */
"needs proxy" = "требует прокси";

/* WebFoundationErrorNotConnectedToInternetError description */
"no Internet connection" = "нет интернет-подключения";

/* HTTP result code string */
"no content" = "нет содержимого";

/* HTTP result code string */
"no error" = "нет ошибки";

/* HTTP result code string */
"no longer exists" = "больше не существует";

/* WebFoundationErrorNoPermissionsToReadFile description */
"no permissions to read file" = "нет прав чтения файла";

/* HTTP result code string */
"non-authoritative information" = "ненадежная информация";

/* HTTP result code string */
"not found" = "не найдено";

/* HTTP result code string */
"not modified" = "не изменено";

/* HTTP result code string */
"partial content" = "частичное содержимое";

/* HTTP result code string */
"payment required" = "требует оплаты";

/* HTTP result code string */
"precondition failed" = "сбой предусловия";

/* HTTP result code string */
"proxy authentication required" = "требуется идентификация прокси";

/* HTTP result code string */
"redirected" = "перенаправлено";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"redirected to nowhere" = "недействительное перенаправление";

/* HTTP result code string */
"request timed out" = "время запроса истекло";

/* HTTP result code string */
"request too large" = "запрос слишком велик";

/* HTTP result code string */
"requested URL too long" = "запрошенный URL-адрес - слишком длинный";

/* HTTP result code string */
"requested range not satisfiable" = "запрошенный диапазон недействителен";

/* HTTP result code string */
"reset content" = "сбросить содержимое";

/* WebFoundationErrorResourceUnavailableError description */
"resource unavailable" = "ресурс недоступен";

/* WebFoundationErrorSecureConnectionFailed description */
"secure connection failed" = "не удалось выполнить безопасное подключение";

/* HTTP result code string */
"see other" = "см. другое";

/* HTTP result code string */
"server error" = "ошибка сервера";

/* HTTP result code string */
"service unavailable" = "служба недоступна";

/* HTTP result code string */
"success" = "успешно";

/* HTTP result code string */
"switching protocols" = "переключение протоколов";

/* HTTP result code string */
"temporarily redirected" = "временно перенаправлен";

/* WebFoundationErrorTimedOut description */
"timed out" = "время истекло";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"too many HTTP redirects" = "слишком много переадресовок HTTP";

/* HTTP result code string */
"unacceptable" = "неприемлемо";

/* HTTP result code string */
"unauthorized" = "неавторизовано";

/* HTTP result code string */
"unimplemented" = "неприменимо";

/* Unknown filename */
"unknown" = "неизвестно";

/* WebFoundationErrorUnsupportedURL description */
"unsupported URL" = "URL-адрес не поддерживается";

/* HTTP result code string */
"unsupported media type" = "тип носителя не поддерживается";

/* HTTP result code string */
"unsupported version" = "версия не поддерживается";

/* WebFoundationErrorServerCertificateUntrusted description */
"untrusted server certificate" = "ненадежный сертификат сервера";

/* WebFoundationErrorZeroByteResourceError description */
"zero byte resource" = "ресурс с нулевым размером";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"resource exceeds maximum size" = "ресурс превышает максимальный размер";
